

export const timePeriodsData = [
  {
    id: 1, title: "Первая мировая война и ее последствия", startDate: 1914, endDate: 1929, events: [
      { id: 1, year: 1914, description: "Начало Первой мировой войны, спровоцированное убийством эрцгерцога Франца Фердинанда, привело к масштабной войне в Европе." },
      { id: 2, year: 1917, description: "Октябрьская революция в России свергла царизм и привела к установлению большевистского режима, что значительно повлияло на ход войны." },
      { id: 3, year: 1918, description: "Завершение Первой мировой войны подписанием Компьенского перемирия.  Война оставила после себя разруху и миллионы жертв." },
      { id: 4, year: 1919, description: "Версальская мирная конференция, на которой были подписаны мирные договоры, которые привели к новым территориальным переделам в Европе." },
      { id: 5, year: 1929, description: "Началась Великая депрессия, мировой экономический кризис, который имел катастрофические последствия для многих стран мира." },
      { id: 6, year: 1922, description: "Образование СССР, объединение нескольких советских республик в единое государство, что изменило геополитическую карту мира." },
      { id: 7, year: 1920, description: "Лига Наций начинает работу с целью предотвращения будущих войн, хотя и не смогла предотвратить Вторую мировую войну." }
    ]
  },
  {
    id: 2, title: "Вторая мировая война и Холодная война", startDate: 1939, endDate: 1991, events: [
      { id: 8, year: 1939, description: "Начало Второй мировой войны с вторжения Германии в Польшу, что привело к масштабному конфликту, охватившему весь мир." },
      { id: 9, year: 1941, description: "Нападение Германии на СССР, открывшее Восточный фронт, стало поворотным моментом во Второй мировой войне." },
      { id: 10, year: 1945, description: "Капитуляция Германии и Японии, завершение Второй мировой войны, сопровождавшееся огромными потерями и разрушениями." },
      { id: 11, year: 1947, description: "Начало Холодной войны, период геополитической напряженности между США и СССР, гонка вооружений и идеологическое противостояние." },
      { id: 12, year: 1962, description: "Карибский кризис, конфликт между США и СССР, угрожавший перерасти в ядерную войну, стал одним из самых опасных моментов Холодной войны." },
      { id: 13, year: 1989, description: "Падение Берлинской стены, символическое событие, ознаменовавшее начало конца Холодной войны и разделения Германии." },
      { id: 14, year: 1991, description: "Распад СССР, событие, которое радикально изменило геополитический ландшафт мира и ознаменовало окончание Холодной войны." }
    ]
  },
  {
    id: 3, title: "Эра компьютеров и интернета", startDate: 1970, endDate: 2000, events: [
      { id: 15, year: 1971, description: "Разработка микропроцессора Intel 4004, первого коммерчески успешного микропроцессора, положила начало революции в вычислительной технике." },
      { id: 16, year: 1981, description: "Представлен IBM PC, персональный компьютер, который стал стандартом de facto и способствовал массовому распространению компьютеров." },
      { id: 17, year: 1989, description: "Всемирная паутина становится доступной, Tim Berners-Lee разработал систему, которая в итоге превратилась в глобальную сеть Интернет." },
      { id: 18, year: 1990, description: "Начало развития мобильной связи, появление первых мобильных телефонов, которые со временем стали неотъемлемой частью жизни людей." },
      { id: 19, year: 1995, description: "Появление Windows 95, операционной системы, которая значительно упростила использование персональных компьютеров и стала очень популярной." },
      { id: 20, year: 1998, description: "Google создан, поисковая система, которая стала доминирующим инструментом поиска информации в интернете." },
      { id: 21, year: 2000, description: "Начало XXI века, начало новой эры, отмеченное быстрым развитием технологий и глобализацией." }
    ]
  },
  {
    id: 4, title: "Глобализация и новые технологии", startDate: 2000, endDate: 2010, events: [
      { id: 22, year: 2001, description: "Террористические акты 11 сентября в США, которые привели к войне в Афганистане и Ираке, а также к усилению мер безопасности во всем мире." },
      { id: 23, year: 2007, description: "Глобальный финансовый кризис, начавшийся с ипотечного кризиса в США, привел к мировой рецессии и глубоким экономическим последствиям." },
      { id: 24, year: 2008, description: "Появление смартфонов, мобильных телефонов с сенсорными экранами и расширенными функциями" },
      { id: 25, year: 2009, description: "Распространение социальных сетей, таких как Facebook и Twitter, которые стали основными платформами для общения и обмена информацией." },
      { id: 26, year: 2004, description: "Facebook запущена, социальная сеть, которая стала одной из самых популярных платформ в мире." },
      { id: 27, year: 2006, description: "Twitter запущена, микро-блоггинг платформа, которая используется для быстрого обмена короткими сообщениями." },
      { id: 28, year: 2010, description: "iPhone 4 выходит на рынок, смартфон, который стал символом эры смартфонов и установил новые стандарты для мобильных устройств." }
    ]
  },
  {
    id: 5, title: "Эпоха больших данных и искусственного интеллекта", startDate: 2010, endDate: 2020, events: [
      { id: 29, year: 2011, description: "Siri представлена, виртуальный помощник, который стал прорывом в области распознавания речи и обработки естественного языка." },
      { id: 30, year: 2012, description: "Instagram куплена Facebook, социальная сеть, которая стала одной из самых популярных платформ для обмена фотографиями и видео." },
      { id: 31, year: 2014, description: "Появление IoT (Интернет вещей), сеть физических объектов, подключенных к интернету и способных обмениваться данными." },
      { id: 32, year: 2016, description: "AlphaGo побеждает в го, программа искусственного интеллекта, которая победила чемпиона мира в сложной настольной игре го." },
      { id: 33, year: 2018, description: "Распространение блокчейна, технологии, лежащей в основе криптовалют, которая имеет потенциал для революционизирования многих отраслей." },
      { id: 34, year: 2019, description: "5G начинает внедряться, технология беспроводной связи следующего поколения, которая обеспечивает более высокие скорости передачи данных." },
      { id: 35, year: 2020, description: "Начало пандемии COVID-19, глобальная пандемия, которая имела глубокие социальные, экономические и политические последствия." }
    ]
  },
  {
    id: 6, title: "Современный мир: вызовы и перспективы", startDate: 2020, endDate: 2023, events: [
      { id: 36, year: 2020, description: "Пандемия COVID-19, глобальная пандемия, которая привела к значительным изменениям в жизни людей во всем мире." },
      { id: 37, year: 2021, description: "Быстрое развитие вакцин против COVID-19, что дало надежду на преодоление пандемии." },
      { id: 38, year: 2022, description: "Война в Украине, крупномасштабный военный конфликт, который вызвал глобальный кризис и привел к гуманитарной катастрофе." },
      { id: 39, year: 2022, description: "Глобальный энергетический кризис, который привел к росту цен на энергоресурсы и экономическим проблемам во многих странах." },
      { id: 40, year: 2023, description: "Продолжение цифровизации, ускоренное пандемией, которое трансформирует различные аспекты жизни людей и бизнеса." },
      { id: 41, year: 2023, description: "Климатические изменения, которые представляют собой серьезную угрозу для планеты и требуют глобальных действий для их смягчения." },
      { id: 42, year: 2023, description: "Развитие технологий ИИ, которые имеют потенциал для революционизирования многих отраслей, но также вызывают этические и социальные вопросы." }
    ]
  }
];